//event1
events[0]("你父母要求你和他們一起出門拜拜，你會選...?","1. 開心的出門和他們拜拜/2. 覺得這就是迷信，到底他媽三小/3. 跟他們說老子就是文昌帝君，不用拜");
events[0]->setResultOne1(0,3n,2n,0,0,5n,"你是個懂得讀空氣的人",3,10);
events[0]->setResultOne2(n,3n,2n,0,0,4n,"有拜有保庇");
events[0]->setResultTwo1(2n,-2n,-2n,0,0,-n,"雖然書讀得多，但也不能白目...",1,15);
events[0]->setResultTwo2(0,-2n,-2n,0,0,-n,"你這白目鬼...");
events[0]->setResultThree1(n,-2n,-5n,0,0,-3n,"今天文昌帝君開心，沒有給妳很大懲罰...",6,20);
events[0]->setResultThree2(n,-2n,-5n,0,0,-6n,"今天運氣不好，文章帝君生氣了，給你下降頭...");

//event2
events[1]("期中考在即，你打算如何應考...?","1. 專心準備，提升在校成績有助於升學/2. 都要學測了，當然是準備學測，誰跟你在那邊期中考/3. 反正我這輩子就這樣了，躺平比較快");
events[1]->setResultOne1(3n,0,0,0,3n,0,"你習慣爆讀了，效果顯著",4,15);
events[1]->setResultOne2(2n,0,0,0,4n,0,"你還沒習慣爆讀，你感覺有點累...");
events[1]->setResultTwo1(2n,0,-n,2n,0,0,"你讀了好多學測範圍，已經沒什麼好進步的了",1,20);
events[1]->setResultTwo2(3n,0,-n,3n,0,0,"你進步了許多！但也感到有些疲累");
events[1]->setResultThree1(-n,2n,3n,2n,0,0,"你帶動了躺平風潮，但太頹廢使你學歷下滑",2,10);
events[1]->setResultThree2(-n,n,n,2n,0,0,"沒什麼人跟你一起躺平，但依然有迴響...");

//event3
events[2]("要學測了，但你還是克制不住原始衝動交往了，在過程中，他/她要你跟他出去玩，你會...?","1. 玩啊，學測爆了還能再考一次，但伴侶沒了很難找第二個/2. 不出門玩，專心準備學測/3. 跟他/她說這個週末有事，但是陪另一個人出去玩");
events[2]->setResultOne1(-n,n,2n,0,n,-n,"你已經讀很多書了，玩一下問題不大，而且提升好感度了！",1,15);
events[2]->setResultOne2(-2n,n,2n,0,n,-n,"都不讀書還玩，學力下降了齁...");
events[2]->setResultTwo1(3n,-n,-2n,0,0,0,"幸好他對你好感度高，在不被討厭的情況下你學了許多",2,13);
events[2]->setResultTwo2(3n,-2n,-4n,0,0,0,"男人，只會影響我做題的速度（妳似乎被討厭了）");
events[2]->setResultThree1(2n,0,n,0,0,2n,"運氣不錯，他沒有不高興，反而因為你會規劃時間而覺得妳很棒",6,15);
events[2]->setResultThree2(2n,0,-n,0,0,0,"可惜了，他今天不是很開心，但有給理由他覺得合理");

//event4
events[3]("在路上遇到推銷股票的店員，他說有一個剛上市的新創公司要你參考看看，你會...?","1. 讀書啊，不要搞那些有的沒的/2. 忽略他然後去找朋友玩/3. 老子賭狗，不試試怎麼知道，本金allin!!");
events[3]->setResultOne1(2n,0,-n,0,0,n,"你認真讀書不碰股票，心情穩定，但被推銷員暗中討厭",1,20);
events[3]->setResultOne2(n,0,0,-n,0,n,"推銷員有點不喜歡你...");
events[3]->setResultTwo1(0,0,-n,0,n,0,"妳忽略他但他一直盧你，但妳不怎麼覺得煩",4,15);
events[3]->setResultTwo2(0,0,-n,0,-2n,0,"他一直盧你，你感到有些疲累");
events[3]->setResultThree1(n,5n,0,0,0,-4n,"你很幸運的遇到了投資大師，賺了一波大的，朋友++",6,25);
events[3]->setResultThree2(-2,-2n,0,0,0,-n,"早知道看股的時間拿來讀書就好，下輩子還跟大哥一起投資");

//event5
events[4]("你的目標校系實驗室因為操作不當爆炸了，該校決定讓該系招生人數砍半以去蕪存菁，你會...?","1. 轉換跑道，改成其他學系/2. 台大有什麼了不起，爛台大，鬼轉其他學校/3. 開始更努力爆讀，並從此討厭可莉玩家");
events[4]->setResultOne1(2n,0,0,0,n,0,"幸好你書看得多，轉換跑道不需要耗費你太多精力",1,21);
events[4]->setResultOne2(n,0,0,0,3n,0,"完蛋，鬼轉一個讓你有點力不從心");
events[4]->setResultTwo1(-n,n,2n,0,-n,0,"真巧，妳的朋友們也這樣想，一起逃",2,15);
events[4]->setResultTwo2(-n,0,n,0,-n,0,"哇勒，沒人想跟你一起鬼轉，可憐...");
events[4]->setResultThree1(4n,0,0,-n,3n,0,"你爆讀了一波，獲益良多，但有點累了",4,20);
events[4]->setResultThree2(3n,0,0,0,4n,0,"累死，名額減徵真的會讓人讀死");

//event6
events[5]("你的同學出車禍了，但你有點燒機讀不完，你會...?","1. 讀書什麼的怎麼可能有朋友重要，當然是去探望啊/2. 我都要讀不完了你給我搞這齣，絕交/3. 乾好難抉擇，啊想到了！去醫院陪他讀書！");
events[5]->setResultOne1(-n,3n,3n,0,0,n,"朋友覺得暖na，對你的評價大幅上升",1,15);
events[5]->setResultOne2(-2n,3n,3n,0,0,n,"朋友覺得暖na，對你的評價大幅上升");
events[5]->setResultTwo1(2n,-n,-n,0,0,0,"好吧，確實要考試了，妳的朋友這麼想著...",2,15);
events[5]->setResultTwo2(2n,-3n,-2n,0,0,0,"這人怎麼那麼無情，妳的朋友這麼想著...");
events[5]->setResultThree1(2n,n,2n,0,n,0,"朋友覺得你很聰明，雖然很累但你們度過了有意義的時光",2,15);
events[5]->setResultThree2(2n,2n,3n,0,2n,0,"朋友對你的觀感提升不少，聰明na");

//event7
events[6]("你爸媽今天突然被公司裁員了，家裡氣氛凝重，你想要...?","1. 好好讀書，大人的是小孩不要管/2. 身為孩子必須當一下和事佬，去緩和氣氛/3. 反正我這輩子就這樣了，躺平比較快");
events[6]->setResultOne1(2n,0,-n,-n,n,0,"看在你乖乖讀書有成果的份上，爸媽沒有情勒妳，但你有點累了",1,20);
events[6]->setResultOne2(2n,0,-2n,-n,n,0,"書沒讀好還這樣，哎，到底了，妳父母這樣覺得...");
events[6]->setResultTwo1(0,0,n,0,n,2n,"運氣不錯，妳剛好用他們最想聽的話安慰到他們了",6,10);
events[6]->setResultTwo2(0,0,n,0,n,n,"讚讚，雖然不是這麼中聽，但他們還是被安慰到了");
events[6]->setResultThree1(-n,-n,-n,-2n,0,-n,"有讀書也不能這樣躺平吧，父母生氣地說道...",1,20);
events[6]->setResultThree2(-3n,-n,-n,-2n,0,-n,"這孩子怎麼不會讀空氣也不會讀書啊，父母如此喃喃自語道...");

//event8
events[7]("你的兄弟突然把他的秘密男友帶回家，你父母覺得難以接受，家中氣氛尷尬，你會...?","1. 把自己關在房間，他們的事他們自己處理/2. 跟爸媽講一下現在開放的交往風氣，跟他們說這是哥哥/弟弟的自由/3. 離家出走，這個家沒救了");
events[7]->setResultOne1(n,0,-n,0,n,-2n,"除了讀到一點書以外什麼都沒發生",1,15);
events[7]->setResultOne2(0,0,-n,0,2n,-n,"這樣的低氣壓讓你讀不下書，你覺得一天都白費了");
events[7]->setResultTwo1(0,2n,2n,0,2n,3n,"父母覺得你是他們的孩子非常幸運，他們很開心",3,15);
events[7]->setResultTwo2(0,n,n,0,3n,3n,"你用了比較長的時間說服他們，累了");
events[7]->setResultThree1(-3n,-2n,-2n,0,n,0,"你在外面流浪許久，荒廢課業，父母擔心",4,15);
events[7]->setResultThree2(-n,-n,-n,0,2n,0,"幸好你是弱雞，流浪不了多久，課業沒有完全荒廢，但妳好累");

//event9
events[8]("你家人買的台股綠油油一片，他們心情非常躁，你會...?","1. 跟他們說「啊哈哈我同學美股也綠一片啦」/2. 給他們看紅通通的考卷/3. 安慰他們投資理財有賺有賠，投資前請詳閱公開說明書");
events[8]->setResultOne1(0,0,-3n,0,-n,-2n,"妳超幸運，他們今天心情沒有燥到很誇張，但還是小不爽",6,30);
events[8]->setResultOne2(0,0,-4n,0,-2n,-2n,"你被打了一頓，你在家人心中留下不好印象");
events[8]->setResultTwo1(-n,0,n,0,0,2n,"你家人知道你成績不錯，會這樣一定是意外，他們獲得些許安慰",1,20);
events[8]->setResultTwo2(-n,0,-n,0,0,-n,"家人覺得讀不好書還這樣白目，你被打了一頓");
events[8]->setResultThree1(n,0,n,0,0,n,"你在安慰的同時學到了一些理財內容，薛爆",1,15);
events[8]->setResultThree2(0,0,n,0,0,n,"有安慰到，但不多");

//event10
events[9]("你發現你閨蜜在情人節收到一堆巧克力但你一個都沒收到，你會...?","1. 開始一個人哭/2. 跟閨蜜說他太胖了不適合吃甜的/3. 幫他慶祝，這樣他就會分你一些巧克力");
events[9]->setResultOne1(0,0,0,0,2n,0,"妳哭得有點累了",4,15);
events[9]->setResultOne2(0,0,0,0,3n,0,"妳哭得有點累了");
events[9]->setResultTwo1(0,-n,-2n,0,0,0,"閨蜜覺得交情再好也不能這樣，她有點難過",2,20);
events[9]->setResultTwo2(0,-3n,-5n,0,2n,-2n,"閨蜜覺得妳超雞掰，開始散佈妳是ㄅㄗ的謠言");
events[9]->setResultThree1(0,n,2n,0,0,2n,"閨蜜覺得有你這樣的朋友很幸運，開心～",3,15);
events[9]->setResultThree2(0,n,2n,0,0,0,"閨蜜覺得妳很讚，好耶～");